{"backend": "tensorflow", "keras_version": "2.0.5", "config": [{"config": {"strides": [3, 3], "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 200, 200, 3], "use_bias": true, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [3, 3], "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 128}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 2}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}
